<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"4a09840ea36ae6ae2af2ace5d7cc168e945f64305aef77c630ca68ad138e3360","plan_job_ref":"Job Environment Main - Plan #1602 at https://github.com/jarrod-lowe/wildsea/actions/runs/17090403301","plan_out_hash":"fcc86b7e86e79755c45011f0d72a7a57867a8452d9dea4add883341f86931801","plan_hash":"23ab82a0999745a40e7995ba556c6857e7c6e467fcda96909eb0c3c0ee15cbf3","plan_text_format":"diff","version":"2.2.2"} -->
Terraform plan in __terraform/environment/wildsea__
With backend config: `bucket=terraform-state-021891603679 key=primary/terraform.tfstate region=ap-southeast-2`<details open><summary>With variables</summary>

```hcl
domain_name          = "wildsea.lowe.kiwi"
environment          = "primary"
google_client_id     = (sensitive value)
google_client_secret = (sensitive value)
saml_metadata_url    = (sensitive value)
```
</details>
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.wildsea.data.aws_iam_policy_document.ui will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ui" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "s3:GetObject",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:s3:::wildsea-primary-ui/*",
            ]
+           sid       = "CDNRead"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "arn:aws:cloudfront::021891603679:distribution/E2KPUTZ78NDDZ6",
                ]
+               variable = "aws:SourceArn"
            }

+           principals {
+               identifiers = [
+                   "cloudfront.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:s3:::wildsea-primary-ui",
            ]
+           sid       = "CDNList"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "arn:aws:cloudfront::021891603679:distribution/E2KPUTZ78NDDZ6",
                ]
+               variable = "aws:SourceArn"
            }

+           principals {
+               identifiers = [
+                   "cloudfront.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
+       statement {
+           actions   = [
+               "s3:*",
            ]
+           effect    = "Deny"
+           resources = [
+               "arn:aws:s3:::wildsea-primary-ui",
+               "arn:aws:s3:::wildsea-primary-ui/*",
            ]
+           sid       = "BlockHTTP"

+           condition {
+               test     = "Bool"
+               values   = [
+                   "false",
                ]
+               variable = "aws:SecureTransport"
            }

+           principals {
+               identifiers = [
+                   "*",
                ]
+               type        = "AWS"
            }
        }
    }

  # module.wildsea.aws_cloudfront_distribution.cdn will be updated in-place
!~  resource "aws_cloudfront_distribution" "cdn" {
        id                              = "E2KPUTZ78NDDZ6"
        tags                            = {
            "Name" = "Wildsea-primary-cdn"
        }
#        (22 unchanged attributes hidden)

!~      default_cache_behavior {
#            (16 unchanged attributes hidden)

-           function_association {
-               event_type   = "viewer-request" -> null
-               function_arn = "arn:aws:cloudfront::021891603679:function/Wildsea-dev-spa-routing" -> null
            }
+           function_association {
+               event_type   = "viewer-request"
+               function_arn = "arn:aws:cloudfront::021891603679:function/Wildsea-primary-spa-routing"
            }
        }

#        (3 unchanged blocks hidden)
    }

  # module.wildsea.aws_cloudfront_function.spa_routing will be updated in-place
!~  resource "aws_cloudfront_function" "spa_routing" {
!~      code                         = <<-EOT
            function handler(event) {
          -     const request = event.request;
          +     var request = event.request;
          -     const uri = request.uri;
          +     var uri = request.uri;
                
                // If the URI doesn't contain a file extension and isn't the root
                // redirect to index.html to let React Router handle it
                if (!uri.includes('.') && uri !== '/') {
                    request.uri = '/index.html';
                }
                
                return request;
            }
        EOT
        id                           = "Wildsea-primary-spa-routing"
        name                         = "Wildsea-primary-spa-routing"
#        (8 unchanged attributes hidden)
    }

  # module.wildsea.aws_s3_bucket_policy.ui will be updated in-place
!~  resource "aws_s3_bucket_policy" "ui" {
        id     = "wildsea-primary-ui"
!~      policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "s3:GetObject"
-                       Condition = {
-                           StringEquals = {
-                               "aws:SourceArn" = "arn:aws:cloudfront::021891603679:distribution/E2KPUTZ78NDDZ6"
                            }
                        }
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "cloudfront.amazonaws.com"
                        }
-                       Resource  = "arn:aws:s3:::wildsea-primary-ui/*"
-                       Sid       = "CDNRead"
                    },
-                   {
-                       Action    = "s3:ListBucket"
-                       Condition = {
-                           StringEquals = {
-                               "aws:SourceArn" = "arn:aws:cloudfront::021891603679:distribution/E2KPUTZ78NDDZ6"
                            }
                        }
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "cloudfront.amazonaws.com"
                        }
-                       Resource  = "arn:aws:s3:::wildsea-primary-ui"
-                       Sid       = "CDNList"
                    },
-                   {
-                       Action    = "s3:*"
-                       Condition = {
-                           Bool = {
-                               "aws:SecureTransport" = "false"
                            }
                        }
-                       Effect    = "Deny"
-                       Principal = {
-                           AWS = "*"
                        }
-                       Resource  = [
-                           "arn:aws:s3:::wildsea-primary-ui/*",
-                           "arn:aws:s3:::wildsea-primary-ui",
                        ]
-                       Sid       = "BlockHTTP"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
#        (1 unchanged attribute hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Environment Main - Plan #1602](https://github.com/jarrod-lowe/wildsea/actions/runs/17090403301)